Repository: thomas-domville/AppleVis
Catalog: AppleVis/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, el, es, fa, fr, he, hi, id, it, ja, ko, nl, pl, pt, ru, sv, th, tr, uk, vi, zh_hans

source: Mouse Squeak, Apple Crunch, Golden Retriever Bark, System Default, and each one's description showed up in English no matter what language the app was set to, in both setup and Settings > Notifications — now fixed and translated into all 22 supported languages.
ar: مربع صرير الفأرة، وقرمشة تفاحة، ونباح كلب جولدن ريتريفر، والافتراضي للنظام، ووصف كل واحد منها كانت تظهر بالإنجليزية بغض النظر عن اللغة المضبوطة للتطبيق، سواء في الإعداد أو في الإعدادات > الإشعارات — تم الإصلاح الآن وتُرجمت إلى جميع اللغات الـ22 المدعومة.
de: Mouse Squeak, Apple Crunch, Golden Retriever Bark, System Default und die jeweilige Beschreibung erschienen auf Englisch, egal welche Sprache die App eingestellt hatte, sowohl in der Einrichtung als auch in Einstellungen > Benachrichtigungen — jetzt behoben und in alle 22 unterstützten Sprachen übersetzt.
el: Το Mouse Squeak, το Apple Crunch, το Golden Retriever Bark, το Προεπιλογή Συστήματος, και η περιγραφή καθενός εμφανίζονταν στα αγγλικά ανεξάρτητα από τη γλώσσα της εφαρμογής, τόσο στη ρύθμιση όσο και στις Ρυθμίσεις > Ειδοποιήσεις — τώρα διορθώθηκε και μεταφράστηκε σε όλες τις 22 υποστηριζόμενες γλώσσες.
es: Mouse Squeak, Apple Crunch, Golden Retriever Bark, Predeterminado del sistema, y la descripción de cada uno aparecían en inglés sin importar el idioma configurado en la app, tanto en la configuración como en Configuración > Notificaciones — ahora solucionado y traducido a los 22 idiomas admitidos.
fa: Mouse Squeak، Apple Crunch، Golden Retriever Bark، پیش‌فرض سیستم، و توضیحات هرکدام صرف‌نظر از زبان تنظیم‌شدهٔ برنامه، هم در راه‌اندازی و هم در تنظیمات > اعلان‌ها، به انگلیسی نمایش داده می‌شدند — اکنون برطرف شده و به هر ۲۲ زبان پشتیبانی‌شده ترجمه شده است.
fr: Mouse Squeak, Apple Crunch, Golden Retriever Bark, Par défaut du système, et la description de chacun s'affichaient en anglais quelle que soit la langue de l'appli, aussi bien dans la configuration que dans Réglages > Notifications — désormais corrigé et traduit dans les 22 langues prises en charge.
he: Mouse Squeak, Apple Crunch, Golden Retriever Bark, ברירת המחדל של המערכת, והתיאור של כל אחד מהם הופיעו באנגלית ללא קשר לשפת האפליקציה, גם בהגדרה וגם בהגדרות > התראות — כעת תוקן ותורגם לכל 22 השפות הנתמכות.
hi: Mouse Squeak, Apple Crunch, Golden Retriever Bark, System Default, और हर एक का विवरण, ऐप की भाषा चाहे जो भी सेट हो, सेटअप और सेटिंग्स > सूचनाएं दोनों में अंग्रेज़ी में दिखता था — अब ठीक कर दिया गया है और सभी 22 समर्थित भाषाओं में अनुवादित किया गया है।
id: Mouse Squeak, Apple Crunch, Golden Retriever Bark, Default Sistem, dan deskripsi masing-masing muncul dalam bahasa Inggris apa pun bahasa yang disetel di aplikasi, baik di penyiapan maupun Pengaturan > Notifikasi — sekarang diperbaiki dan diterjemahkan ke semua 22 bahasa yang didukung.
it: Mouse Squeak, Apple Crunch, Golden Retriever Bark, Predefinito di sistema, e la descrizione di ciascuno comparivano in inglese indipendentemente dalla lingua impostata nell'app, sia nella configurazione sia in Impostazioni > Notifiche — ora risolto e tradotto in tutte le 22 lingue supportate.
ja: Mouse Squeak、Apple Crunch、Golden Retriever Bark、システムデフォルト、そしてそれぞれの説明は、アプリの言語設定にかかわらず、セットアップと設定 > 通知の両方で英語のまま表示されていました——現在は修正され、サポートされている全22言語に翻訳されています。
ko: Mouse Squeak, Apple Crunch, Golden Retriever Bark, 시스템 기본값, 그리고 각각의 설명은 앱 언어 설정과 관계없이 설정 및 설정 > 알림 모두에서 영어로 표시되었습니다 — 이제 수정되어 지원되는 22개 언어 모두로 번역되었습니다.
nl: Mouse Squeak, Apple Crunch, Golden Retriever Bark, Systeemstandaard, en de beschrijving van elk verschenen in het Engels, ongeacht de taal die de app had ingesteld, zowel bij het instellen als in Instellingen > Meldingen — nu opgelost en vertaald naar alle 22 ondersteunde talen.
pl: Mouse Squeak, Apple Crunch, Golden Retriever Bark, Domyślny systemowy oraz opis każdego z nich wyświetlały się po angielsku niezależnie od ustawionego języka aplikacji, zarówno podczas konfiguracji, jak i w Ustawienia > Powiadomienia — teraz naprawione i przetłumaczone na wszystkie 22 obsługiwane języki.
pt: Mouse Squeak, Apple Crunch, Golden Retriever Bark, Padrão do sistema, e a descrição de cada um apareciam em inglês independentemente do idioma configurado no app, tanto na configuração quanto em Configurações > Notificações — agora corrigido e traduzido para todos os 22 idiomas compatíveis.
ru: Mouse Squeak, Apple Crunch, Golden Retriever Bark, Системный по умолчанию и описание каждого из них отображались на английском независимо от выбранного языка приложения, как при настройке, так и в Настройки > Уведомления — теперь исправлено и переведено на все 22 поддерживаемых языка.
sv: Mouse Squeak, Apple Crunch, Golden Retriever Bark, Systemstandard, och beskrivningen av var och en visades på engelska oavsett vilket språk appen var inställd på, både i konfigurationen och i Inställningar > Aviseringar — nu åtgärdat och översatt till alla 22 språk som stöds.
th: Mouse Squeak, Apple Crunch, Golden Retriever Bark, ค่าเริ่มต้นของระบบ และคำอธิบายของแต่ละเสียงจะแสดงเป็นภาษาอังกฤษไม่ว่าแอปจะตั้งค่าเป็นภาษาใด ทั้งในการตั้งค่าเริ่มต้นและการตั้งค่า > การแจ้งเตือน — ตอนนี้แก้ไขแล้วและแปลเป็นทั้ง 22 ภาษาที่รองรับ
tr: Mouse Squeak, Apple Crunch, Golden Retriever Bark, Sistem Varsayılanı ve her birinin açıklaması, uygulama hangi dile ayarlanmış olursa olsun hem kurulumda hem de Ayarlar > Bildirimler'de İngilizce görünüyordu — artık düzeltildi ve desteklenen 22 dilin tümüne çevrildi.
uk: Mouse Squeak, Apple Crunch, Golden Retriever Bark, Системний за умовчанням і опис кожного з них відображалися англійською незалежно від мови застосунку, як під час налаштування, так і в Налаштування > Сповіщення — тепер виправлено і перекладено на всі 22 підтримувані мови.
vi: Mouse Squeak, Apple Crunch, Golden Retriever Bark, Mặc định hệ thống, và mô tả của từng âm thanh đều hiển thị bằng tiếng Anh bất kể ứng dụng được đặt ngôn ngữ nào, cả trong thiết lập lẫn Cài đặt > Thông báo — nay đã khắc phục và dịch sang toàn bộ 22 ngôn ngữ được hỗ trợ.
zh_hans: Mouse Squeak、Apple Crunch、Golden Retriever Bark、系统默认，以及每个选项的描述，无论应用设置为哪种语言，在设置流程和"设置 > 通知"中都会显示为英文——现已修复，并翻译为全部 22 种支持的语言。

source: Every step's title and explanation, every button, and the tour's own name showed up in English throughout the entire tour no matter what language the app was set to — the same bug already fixed elsewhere in the app, and in this case, all 28 steps already had full translations sitting unused. Fixed, so all of it displays correctly now.
ar: عنوان كل خطوة وشرحها، وكل زر، واسم الجولة نفسها كانت تظهر بالإنجليزية في كل أنحاء الجولة بغض النظر عن لغة التطبيق — نفس الخلل الذي أُصلح بالفعل في أماكن أخرى من التطبيق، وفي هذه الحالة كانت جميع الخطوات الـ28 تملك ترجمات كاملة غير مستخدمة أصلًا. تم الإصلاح، فأصبح كل شيء يظهر بشكل صحيح الآن.
de: Titel und Erklärung jedes Schritts, jede Schaltfläche und der Name der Tour selbst erschienen während der gesamten Tour auf Englisch, egal welche Sprache die App eingestellt hatte — derselbe Fehler, der an anderer Stelle in der App bereits behoben wurde, und in diesem Fall hatten alle 28 Schritte bereits vollständige Übersetzungen, die nur ungenutzt herumlagen. Behoben, sodass jetzt alles korrekt angezeigt wird.
el: Ο τίτλος και η επεξήγηση κάθε βήματος, κάθε κουμπί, και το ίδιο το όνομα της περιήγησης εμφανίζονταν στα αγγλικά σε όλη την περιήγηση ανεξάρτητα από τη γλώσσα της εφαρμογής — το ίδιο σφάλμα που είχε ήδη διορθωθεί αλλού στην εφαρμογή, και σε αυτή την περίπτωση, και τα 28 βήματα είχαν ήδη πλήρεις μεταφράσεις που απλώς δεν χρησιμοποιούνταν. Διορθώθηκε, οπότε όλα εμφανίζονται σωστά τώρα.
es: El título y la explicación de cada paso, cada botón, y el propio nombre del recorrido aparecían en inglés durante todo el recorrido sin importar el idioma configurado en la app — el mismo error ya solucionado en otras partes de la app, y en este caso, los 28 pasos ya tenían traducciones completas sin usar. Solucionado, así que ahora todo se muestra correctamente.
fa: عنوان و توضیح هر مرحله، هر دکمه، و نام خود این تور در سراسر تور به انگلیسی نمایش داده می‌شد، صرف‌نظر از زبان تنظیم‌شدهٔ برنامه — همان اشکالی که پیش‌تر در جاهای دیگر برنامه برطرف شده بود، و در این مورد، هر ۲۸ مرحله از پیش ترجمه‌های کامل داشتند که استفاده نمی‌شدند. برطرف شد، پس اکنون همه‌چیز به‌درستی نمایش داده می‌شود.
fr: Le titre et l'explication de chaque étape, chaque bouton, et le nom de la visite elle-même s'affichaient en anglais dans toute la visite quelle que soit la langue de l'appli — le même bug déjà corrigé ailleurs dans l'appli, et dans ce cas, les 28 étapes avaient déjà des traductions complètes qui restaient inutilisées. Corrigé, tout s'affiche donc correctement maintenant.
he: הכותרת וההסבר של כל שלב, כל כפתור, ושם הסיור עצמו הופיעו באנגלית לאורך כל הסיור ללא קשר לשפת האפליקציה — אותה תקלה שכבר תוקנה במקומות אחרים באפליקציה, ובמקרה הזה, לכל 28 השלבים כבר היו תרגומים מלאים שפשוט לא נוצלו. תוקן, כך שהכול מוצג כעת כראוי.
hi: हर स्टेप का शीर्षक और विवरण, हर बटन, और खुद टूर का नाम, ऐप की भाषा चाहे जो भी सेट हो, पूरे टूर में अंग्रेज़ी में दिखता था — यही गड़बड़ी ऐप में कहीं और पहले ही ठीक की जा चुकी थी, और इस मामले में, सभी 28 स्टेप्स के पास पहले से पूरे अनुवाद मौजूद थे जो बस उपयोग नहीं हो रहे थे। ठीक कर दिया गया है, इसलिए अब सब कुछ सही ढंग से दिखता है।
id: Judul dan penjelasan setiap langkah, setiap tombol, dan nama tur itu sendiri muncul dalam bahasa Inggris di seluruh tur apa pun bahasa yang disetel di aplikasi — bug yang sama yang sudah diperbaiki di tempat lain di aplikasi, dan dalam kasus ini, ke-28 langkah sudah memiliki terjemahan lengkap yang hanya belum terpakai. Diperbaiki, jadi semuanya sekarang ditampilkan dengan benar.
it: Il titolo e la spiegazione di ogni passaggio, ogni pulsante, e il nome stesso del tour comparivano in inglese in tutto il tour indipendentemente dalla lingua impostata nell'app — lo stesso bug già corretto altrove nell'app, e in questo caso, tutti e 28 i passaggi avevano già traduzioni complete che restavano inutilizzate. Risolto, quindi ora tutto viene visualizzato correttamente.
ja: 各ステップのタイトルと説明、各ボタン、そしてツアー自体の名前は、アプリの言語設定にかかわらずツアー全体を通して英語のまま表示されていました——アプリの他の場所ですでに修正済みの同じ不具合で、この場合は28ステップすべてにすでに完全な翻訳が用意されていたものの、使われていませんでした。修正済みで、現在はすべて正しく表示されます。
ko: 각 단계의 제목과 설명, 모든 버튼, 그리고 투어 자체의 이름은 앱 언어 설정과 관계없이 투어 전체에서 영어로 표시되었습니다 — 앱 다른 곳에서 이미 수정된 것과 같은 버그이며, 이 경우 28개 단계 모두 이미 완전한 번역이 있었지만 사용되지 않고 있었습니다. 수정되어 이제 모든 것이 올바르게 표시됩니다.
nl: De titel en uitleg van elke stap, elke knop, en de naam van de rondleiding zelf verschenen in het Engels gedurende de hele rondleiding, ongeacht de taal die de app had ingesteld — dezelfde bug die elders in de app al was opgelost, en in dit geval hadden alle 28 stappen al volledige vertalingen die gewoon ongebruikt bleven. Opgelost, dus alles wordt nu correct weergegeven.
pl: Tytuł i wyjaśnienie każdego kroku, każdy przycisk oraz nazwa samego przewodnika wyświetlały się po angielsku w całym przewodniku niezależnie od ustawionego języka aplikacji — ten sam błąd naprawiony już gdzie indziej w aplikacji, a w tym przypadku wszystkie 28 kroków miało już pełne tłumaczenia, które po prostu nie były używane. Naprawione, więc teraz wszystko wyświetla się poprawnie.
pt: O título e a explicação de cada etapa, cada botão, e o próprio nome do tour apareciam em inglês em todo o tour independentemente do idioma configurado no app — o mesmo bug já corrigido em outras partes do app, e neste caso, todas as 28 etapas já tinham traduções completas sem uso. Corrigido, então tudo agora é exibido corretamente.
ru: Заголовок и пояснение каждого шага, каждая кнопка и само название тура отображались на английском на протяжении всего тура независимо от выбранного языка приложения — та же ошибка, уже исправленная в других частях приложения, а в этом случае все 28 шагов уже имели полные переводы, которые просто не использовались. Исправлено, теперь всё отображается правильно.
sv: Titeln och förklaringen för varje steg, varje knapp, och rundturens eget namn visades på engelska genom hela rundturen oavsett vilket språk appen var inställd på — samma bugg som redan åtgärdats någon annanstans i appen, och i det här fallet hade alla 28 steg redan fullständiga översättningar som bara låg oanvända. Åtgärdat, så allt visas korrekt nu.
th: ชื่อและคำอธิบายของแต่ละขั้นตอน ทุกปุ่ม และชื่อของทัวร์เองจะแสดงเป็นภาษาอังกฤษตลอดทั้งทัวร์ไม่ว่าแอปจะตั้งค่าเป็นภาษาใด — เป็นข้อบกพร่องเดียวกับที่แก้ไขไปแล้วในที่อื่นของแอป และในกรณีนี้ ทั้ง 28 ขั้นตอนมีคำแปลครบถ้วนอยู่แล้วแต่ไม่ได้ถูกใช้งาน แก้ไขแล้ว ตอนนี้ทุกอย่างแสดงผลถูกต้อง
tr: Her adımın başlığı ve açıklaması, her düğme ve turun kendi adı, uygulama hangi dile ayarlanmış olursa olsun tur boyunca İngilizce görünüyordu — uygulamanın başka yerlerinde zaten düzeltilmiş olan aynı hata, ve bu durumda, 28 adımın tümünün zaten tam çevirileri vardı, sadece kullanılmıyordu. Düzeltildi, artık her şey doğru şekilde görüntüleniyor.
uk: Заголовок і пояснення кожного кроку, кожна кнопка і сама назва туру відображалися англійською протягом усього туру незалежно від мови застосунку — та сама помилка, вже виправлена в інших частинах застосунку, а в цьому випадку всі 28 кроків уже мали повні переклади, які просто не використовувалися. Виправлено, тож тепер усе відображається правильно.
vi: Tiêu đề và giải thích của mỗi bước, mọi nút, và tên của chuyến tham quan đều hiển thị bằng tiếng Anh trong suốt chuyến tham quan bất kể ứng dụng được đặt ngôn ngữ nào — cùng lỗi đã được khắc phục ở nơi khác trong ứng dụng, và trong trường hợp này, cả 28 bước đều đã có bản dịch đầy đủ nhưng chưa được sử dụng. Đã khắc phục, nên giờ mọi thứ hiển thị chính xác.
zh_hans: 无论应用设置为哪种语言，每个步骤的标题和说明、每个按钮，以及导览本身的名称，在整个导览过程中都会显示为英文——这是应用中其他地方已经修复过的同一个错误，而在这种情况下，全部 28 个步骤其实早就有完整的翻译，只是一直没有被使用。现已修复，现在一切都能正确显示了。

source: Every onboarding step's heading and description, and every What's New entry — this release and all of history — showed up in English no matter what language the app was set to. Both are fixed, and the onboarding strings that had never been translatable in the first place are now translated into all 22 supported languages.
ar: عنوان ووصف كل خطوة في الإعداد، وكل عنصر في ما الجديد — لهذا الإصدار وكل السجل — كانت تظهر بالإنجليزية بغض النظر عن لغة التطبيق. تم إصلاح الأمرين، والنصوص الخاصة بالإعداد التي لم تكن قابلة للترجمة أصلًا أصبحت الآن مترجمة إلى جميع اللغات الـ22 المدعومة.
de: Überschrift und Beschreibung jedes Einrichtungsschritts sowie jeder Eintrag in Neuigkeiten — für dieses Release und die gesamte Historie — erschienen auf Englisch, egal welche Sprache die App eingestellt hatte. Beides ist behoben, und die Einrichtungstexte, die von Anfang an gar nicht übersetzbar waren, sind jetzt in alle 22 unterstützten Sprachen übersetzt.
el: Ο τίτλος και η περιγραφή κάθε βήματος ρύθμισης, καθώς και κάθε καταχώριση στα Νέα — για αυτή την έκδοση και όλο το ιστορικό — εμφανίζονταν στα αγγλικά ανεξάρτητα από τη γλώσσα της εφαρμογής. Και τα δύο διορθώθηκαν, και τα κείμενα ρύθμισης που εξαρχής δεν ήταν μεταφράσιμα είναι τώρα μεταφρασμένα σε όλες τις 22 υποστηριζόμενες γλώσσες.
es: El título y la descripción de cada paso de la configuración, y cada entrada de Novedades — de esta versión y de todo el historial — aparecían en inglés sin importar el idioma configurado en la app. Ambos se solucionaron, y las cadenas de la configuración que nunca fueron traducibles ahora están traducidas a los 22 idiomas admitidos.
fa: عنوان و توضیح هر مرحلهٔ راه‌اندازی، و هر مورد در تازه‌ها — برای این نسخه و تمام تاریخچه — صرف‌نظر از زبان تنظیم‌شدهٔ برنامه، به انگلیسی نمایش داده می‌شد. هر دو برطرف شدند، و رشته‌های راه‌اندازی که از ابتدا قابل ترجمه نبودند، اکنون به هر ۲۲ زبان پشتیبانی‌شده ترجمه شده‌اند.
fr: Le titre et la description de chaque étape de la configuration, et chaque entrée de Nouveautés — pour cette version et tout l'historique — s'affichaient en anglais quelle que soit la langue de l'appli. Les deux sont corrigés, et les chaînes de configuration qui n'avaient jamais été traduisibles au départ sont désormais traduites dans les 22 langues prises en charge.
he: הכותרת והתיאור של כל שלב בהגדרה, וכל פריט במה חדש — עבור גרסה זו וכל ההיסטוריה — הופיעו באנגלית ללא קשר לשפת האפליקציה. שניהם תוקנו, ומחרוזות ההגדרה שמעולם לא היו ניתנות לתרגום מלכתחילה, מתורגמות כעת לכל 22 השפות הנתמכות.
hi: सेटअप के हर स्टेप का शीर्षक और विवरण, और नया क्या है का हर एंट्री — इस रिलीज़ और पूरे इतिहास के लिए — ऐप की भाषा चाहे जो भी सेट हो, अंग्रेज़ी में दिखता था। दोनों ठीक कर दिए गए हैं, और सेटअप की वे स्ट्रिंग्स जो शुरू से ही अनुवाद योग्य नहीं थीं, अब सभी 22 समर्थित भाषाओं में अनुवादित हैं।
id: Judul dan deskripsi setiap langkah orientasi, dan setiap entri di Yang Baru — untuk rilis ini dan seluruh riwayat — muncul dalam bahasa Inggris apa pun bahasa yang disetel di aplikasi. Keduanya diperbaiki, dan string orientasi yang sejak awal tidak pernah bisa diterjemahkan kini diterjemahkan ke semua 22 bahasa yang didukung.
it: Il titolo e la descrizione di ogni passaggio della configurazione, e ogni voce di Novità — per questa versione e tutta la cronologia — comparivano in inglese indipendentemente dalla lingua impostata nell'app. Entrambi risolti, e le stringhe della configurazione che non erano mai state traducibili fin dall'inizio sono ora tradotte in tutte le 22 lingue supportate.
ja: セットアップの各ステップの見出しと説明、そして新機能情報の各項目——今回のリリース分と過去の履歴すべて——は、アプリの言語設定にかかわらず英語のまま表示されていました。どちらも修正され、そもそも翻訳できる仕組みになっていなかったセットアップの文字列も、サポートされている全22言語に翻訳されました。
ko: 설정의 각 단계 제목과 설명, 그리고 새로운 기능의 모든 항목 — 이번 릴리스와 전체 이력 — 은 앱 언어 설정과 관계없이 영어로 표시되었습니다. 둘 다 수정되었으며, 애초에 번역이 불가능했던 설정 문자열도 이제 지원되는 22개 언어 모두로 번역되었습니다.
nl: De titel en beschrijving van elke onboarding-stap, en elk item in Nieuw — voor deze release en de hele geschiedenis — verschenen in het Engels, ongeacht de taal die de app had ingesteld. Beide zijn opgelost, en de onboarding-teksten die nooit vertaalbaar waren geweest, zijn nu vertaald naar alle 22 ondersteunde talen.
pl: Tytuł i opis każdego kroku wdrożenia oraz każdy wpis w Nowości — dla tego wydania i całej historii — wyświetlały się po angielsku niezależnie od ustawionego języka aplikacji. Oba naprawione, a ciągi wdrożenia, które od początku nie były przetłumaczalne, są teraz przetłumaczone na wszystkie 22 obsługiwane języki.
pt: O título e a descrição de cada etapa da integração inicial, e cada item em Novidades — para esta versão e todo o histórico — apareciam em inglês independentemente do idioma configurado no app. Ambos corrigidos, e as strings de integração inicial que nunca haviam sido traduzíveis agora estão traduzidas para todos os 22 idiomas compatíveis.
ru: Заголовок и описание каждого шага вводного процесса, а также каждая запись в разделе «Что нового» — для этого выпуска и всей истории — отображались на английском независимо от выбранного языка приложения. Оба исправлены, а строки вводного процесса, изначально вообще не переводимые, теперь переведены на все 22 поддерживаемых языка.
sv: Rubriken och beskrivningen för varje introduktionssteg, och varje post i Nyheter — för den här versionen och all historik — visades på engelska oavsett vilket språk appen var inställd på. Båda är åtgärdade, och introduktionens textsträngar som aldrig hade varit översättningsbara från början är nu översatta till alla 22 språk som stöds.
th: ชื่อและคำอธิบายของแต่ละขั้นตอนการเริ่มต้นใช้งาน และทุกรายการในมีอะไรใหม่ — สำหรับเวอร์ชันนี้และประวัติทั้งหมด — จะแสดงเป็นภาษาอังกฤษไม่ว่าแอปจะตั้งค่าเป็นภาษาใด แก้ไขทั้งสองอย่างแล้ว และข้อความการเริ่มต้นใช้งานที่ไม่เคยแปลได้ตั้งแต่แรกก็ได้รับการแปลเป็นทั้ง 22 ภาษาที่รองรับแล้ว
tr: Her katılım adımının başlığı ve açıklaması ile Yenilikler'deki her giriş — bu sürüm ve tüm geçmiş için — uygulama hangi dile ayarlanmış olursa olsun İngilizce görünüyordu. İkisi de düzeltildi ve başlangıçtan beri çevrilemeyen katılım dizeleri artık desteklenen 22 dilin tümüne çevrildi.
uk: Заголовок і опис кожного кроку початкового налаштування, а також кожен запис у розділі «Що нового» — для цього випуску і всієї історії — відображалися англійською незалежно від мови застосунку. Обидва виправлено, а рядки початкового налаштування, які спершу взагалі не піддавалися перекладу, тепер перекладені на всі 22 підтримувані мови.
vi: Tiêu đề và mô tả của mỗi bước hướng dẫn ban đầu, và mọi mục trong Có gì mới — cho bản phát hành này và toàn bộ lịch sử — đều hiển thị bằng tiếng Anh bất kể ứng dụng được đặt ngôn ngữ nào. Cả hai đã được khắc phục, và các chuỗi hướng dẫn ban đầu vốn chưa từng dịch được ngay từ đầu giờ đã được dịch sang toàn bộ 22 ngôn ngữ được hỗ trợ.
zh_hans: 无论应用设置为哪种语言，每个引导步骤的标题和说明，以及"新功能"中的每一条内容——本次更新和所有历史记录——都会显示为英文。两者均已修复，最初根本无法翻译的引导文本现已翻译为全部 22 种支持的语言。
